In [1]:
import pandas as pd
import numpy as np
import env

my_url = env.get_db_url(
    env.user,
    env.host,
    env.password,
    'employees')

url = f'mysql+pymysql://{env.user}:{env.password}@{env.host}/employees'

### 4. Use your function to obtain a connection to the employees database.

In [7]:
# pd.read_sql('literal sql syntax to pull query', connection_string)

# using function from env.py
my_url = env.get_db_url(
    env.user,
    env.host,
    env.password,
    'employees')
# method 2
url = f'mysql+pymysql://{env.user}:{env.password}@{env.host}/employees'

# write query and run query and my_url through pd.read_sql
query = 'select * from employees limit 5'
df = pd.read_sql(query, my_url)
df

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

### 5. Once you have successfully run a query:
 - a. Intentionally make a typo in the database url. What kind of error message do you see?

 - b. Intentionally make an error in your SQL query. What does the error message look like?

In [29]:
# a. ANSWER: Access denied
#typo_url = my_url + '5'
#df_t1 = pd.read_sql(query, typo_url)
#df_t1

In [32]:
# b. ANSWER: In one case I got an error message that there was an endeclared variable. 
# In another, there was no error message, it just changed the limit from 5 to 55
#typo_query = query + 't'
#df_t2 = pd.read_sql(typo_query, my_url)
#df_t2

### 6. Read the employees and titles tables into two separate DataFrames.

In [8]:
# for employees table:
# Write query and create DataFrame
query_1 = '''
select *
from
employees
'''
employees_df = pd.read_sql(query_1, my_url)

In [9]:
# for titles table:
# Write query and create DataFrame
query_2 = '''
select * 
from
titles
'''
titles_df = pd.read_sql(query_2, my_url)

### 7. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [14]:
# employees (300024, 6)
print(employees_df.shape)

# titles (443308, 4)
print(titles_df.shape)

# It makes sense that there would be more rows in titles than in employees as employees
# may have several different roles during their time at the company.

(300024, 6)
(443308, 4)

### 8. Display the summary statistics for each DataFrame.

In [49]:
# employees_df
print(employees_df.info())
print(employees_df.describe())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB
None
              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [51]:
# titles_df
print(titles_df.info())
print(titles_df.describe())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB
None
              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

### 9. How many unique titles are in the titles DataFrame?

In [65]:
titles_df.columns

Index(['emp_no', 'title', 'from_date', 'to_date'], dtype='object')

In [68]:
len(pd.unique(titles_df['title']))

7

### 10. What is the oldest date in the to_date column?
ANSWER:1985-03-01

In [90]:
from datetime import date
today = date.today()

In [17]:
# sort by to_date ascending
titles_df.sort_values(
    'to_date', ascending=True
).head(1)

       emp_no     title   from_date     to_date
16064   20869  Engineer  1985-02-17  1985-03-01

### 11. What is the most recent date in the to_date column?
ANSWER: 2002-08-01

In [91]:
## mask of to_dates less than today:
# titles_df['to_date'] < today

# sort by and apply mask
titles_df.sort_values(
    'to_date', ascending=False
)[titles_df['to_date'] < today].head(1)

/var/folders/kj/13f127m163l12181fcrgh1vm0000gn/T/ipykernel_56062/4262389933.py:5: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  titles_df.sort_values(

        emp_no     title   from_date     to_date
197364  233339  Engineer  1996-08-01  2002-08-01